Revit 2027 API
Document.NewSpace(Level, UV) Method
Creates a new space element on the given level at the given location.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space NewSpace(
	Level level,
	UV point
)
Public Function NewSpace (
	level As Level,
	point As UV
) As Space
public:
Space^ NewSpace(
	Level^ level,
	UV^ point
)
member NewSpace :
        level : Level *
        point : UV -> Space
Parameters
level Level
 The level on which the space is to exist.
point UV
 A 2D point that dictates the location on that specified level.
Return Value
Space
 If successful the new space element is returned, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when level or point is null.
InvalidOperationException |  Thrown when the space cannot be created.
ArgumentException | Thrown if the level does not exist in the given document.
See Also
Reference
Document Class
NewSpace Overload
Autodesk.Revit.Creation Namespace